app/views/users/show.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 5]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 5]]
---
    <div class="layout-link">
      <% tweets_user = Tweet.where(user_id: @user.id) %>
      <p id="show-tweets" class="pointer line">Tweets ( <%= tweets_user.count %> )</p>
      <p id="show-likes" class="pointer">Likes ( <%= @user.likes.count %> )</p>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 5]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    <div id="likes" style="display: none;">
      <% @user.likes.each do |like| %>
        <% tweet_user = Tweet.find_by(id: like.tweet_id) %>