app/views/shared/_tweet_card.html.erb

      <% if current_user %>
        <% if Like.find_by(tweet_id: tweet.id, user_id: current_user.id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["tweet_id", 15], ["user_id", 1], ["LIMIT", 1]]

      <div>
        <span><%= tweet.likes.count %></span>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = $1  [["tweet_id", 15]]