app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["tweet_id", 15], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["tweet_id", 15], ["created_at", "2023-01-29 23:04:56.851210"], ["updated_at", "2023-01-29 23:04:56.851210"]]
---
  def destroy
    authorize Like
    tweet_id = params[:id]
    return unless current_user

    like = Like.find_by(tweet_id:, user_id: current_user.id)
    if like.nil?
      Like.create(tweet_id:, user_id: current_user.id)