app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.select { |t| t.parent_id.nil? }
---
SELECT "tweets".* FROM "tweets"

  def show
    @tweets = Tweet.where(parent: @tweet)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."parent_id" = $1  [["parent_id", 15]]

  def update
    if @tweet.update(body: tweet_params[:body])
---
UPDATE "tweets" SET "body" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["body", "ddheberth"], ["updated_at", "2023-01-29 23:26:23.697793"], ["id", 25]]

  def create_tweet(user)
    @tweet = Tweet.new(body: tweet_params[:body], user:)
    if @tweet.save
---
INSERT INTO "tweets" ("body", "replies_count", "likes_count", "user_id", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["body", "ddheberth code"], ["replies_count", 0], ["likes_count", 0], ["user_id", 1], ["created_at", "2023-01-29 23:20:39.308620"], ["updated_at", "2023-01-29 23:20:39.308620"], ["parent_id", nil]]