app/models/like.rb

  def increment_likes
    tweet.increment(:likes_count)
    tweet.save
---
UPDATE "tweets" SET "updated_at" = $1 WHERE "tweets"."id" = $2  [["updated_at", "2023-01-29 22:26:05.067977"], ["id", 1]]